---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitType.IsWithFitting
source: html/20d7e5a7-35f7-5826-61c7-e6cd990b35f8.htm
---
# Autodesk.Revit.DB.Electrical.ConduitType.IsWithFitting Property

Whether this conduit type is with fitting

## Syntax (C#)
```csharp
public bool IsWithFitting { get; }
```

## Remarks
True if this conduit type is with fitting type.